nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_flexio.h
/*
 * Constants & macros for individual FLEXIO_SHIFTCTLn bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTCTLn, field SMOD[2:0] (RW)
 *
 * Configures the mode of the Shifter.
 *
 * Values:
 * - 000 - Disabled.
 * - 001 - Receive mode. Captures the current Shifter content into the SHIFTBUF
 *     on expiration of the Timer.
 * - 010 - Transmit mode. Load SHIFTBUF contents into the Shifter on expiration
 *     of the Timer.
 * - 011 - Reserved.
 * - 100 - Match Store mode. Shifter data is compared to SHIFTBUF content on
 *     expiration of the Timer.
 * - 101 - Match Continuous mode. Shifter data is continuously compared to
 *     SHIFTBUF contents.
 * - 110 - Reserved.
 * - 111 - Reserved.
 */
/*@{*/
#define BP_FLEXIO_SHIFTCTLn_SMOD (0U)      /*!< Bit position for FLEXIO_SHIFTCTLn_SMOD. */
#define BM_FLEXIO_SHIFTCTLn_SMOD (0x00000007U) /*!< Bit mask for FLEXIO_SHIFTCTLn_SMOD. */
#define BS_FLEXIO_SHIFTCTLn_SMOD (3U)      /*!< Bit field size in bits for FLEXIO_SHIFTCTLn_SMOD. */

/*! @brief Read current value of the FLEXIO_SHIFTCTLn_SMOD field. */
#define BR_FLEXIO_SHIFTCTLn_SMOD(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), BP_FLEXIO_SHIFTCTLn_SMOD, BS_FLEXIO_SHIFTCTLn_SMOD))

/*! @brief Format value for bitfield FLEXIO_SHIFTCTLn_SMOD. */
#define BF_FLEXIO_SHIFTCTLn_SMOD(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_SMOD) & BM_FLEXIO_SHIFTCTLn_SMOD)

/*! @brief Set the SMOD field to a new value. */
#define BW_FLEXIO_SHIFTCTLn_SMOD(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_SMOD), BP_FLEXIO_SHIFTCTLn_SMOD, 3))
/*@}*/

/*!
 * @name Register FLEXIO_SHIFTCTLn, field PINPOL[7] (RW)
 *
 * Values:
 * - 0 - Pin is active high
 * - 1 - Pin is active low
 */
/*@{*/
#define BP_FLEXIO_SHIFTCTLn_PINPOL (7U)    /*!< Bit position for FLEXIO_SHIFTCTLn_PINPOL. */
#define BM_FLEXIO_SHIFTCTLn_PINPOL (0x00000080U) /*!< Bit mask for FLEXIO_SHIFTCTLn_PINPOL. */
#define BS_FLEXIO_SHIFTCTLn_PINPOL (1U)    /*!< Bit field size in bits for FLEXIO_SHIFTCTLn_PINPOL. */

/*! @brief Read current value of the FLEXIO_SHIFTCTLn_PINPOL field. */
#define BR_FLEXIO_SHIFTCTLn_PINPOL(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), BP_FLEXIO_SHIFTCTLn_PINPOL, BS_FLEXIO_SHIFTCTLn_PINPOL))

/*! @brief Format value for bitfield FLEXIO_SHIFTCTLn_PINPOL. */
#define BF_FLEXIO_SHIFTCTLn_PINPOL(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_PINPOL) & BM_FLEXIO_SHIFTCTLn_PINPOL)

/*! @brief Set the PINPOL field to a new value. */
#define BW_FLEXIO_SHIFTCTLn_PINPOL(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_PINPOL), BP_FLEXIO_SHIFTCTLn_PINPOL, 1))
/*@}*/

/*!
 * @name Register FLEXIO_SHIFTCTLn, field PINSEL[10:8] (RW)
 *
 * Selects which pin is used by the Shifter input or output.
 */
/*@{*/
#define BP_FLEXIO_SHIFTCTLn_PINSEL (8U)    /*!< Bit position for FLEXIO_SHIFTCTLn_PINSEL. */
#define BM_FLEXIO_SHIFTCTLn_PINSEL (0x00000700U) /*!< Bit mask for FLEXIO_SHIFTCTLn_PINSEL. */
#define BS_FLEXIO_SHIFTCTLn_PINSEL (3U)    /*!< Bit field size in bits for FLEXIO_SHIFTCTLn_PINSEL. */

/*! @brief Read current value of the FLEXIO_SHIFTCTLn_PINSEL field. */
#define BR_FLEXIO_SHIFTCTLn_PINSEL(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), BP_FLEXIO_SHIFTCTLn_PINSEL, BS_FLEXIO_SHIFTCTLn_PINSEL))

/*! @brief Format value for bitfield FLEXIO_SHIFTCTLn_PINSEL. */
#define BF_FLEXIO_SHIFTCTLn_PINSEL(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_PINSEL) & BM_FLEXIO_SHIFTCTLn_PINSEL)

/*! @brief Set the PINSEL field to a new value. */
#define BW_FLEXIO_SHIFTCTLn_PINSEL(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_PINSEL), BP_FLEXIO_SHIFTCTLn_PINSEL, 3))
/*@}*/

/*!
 * @name Register FLEXIO_SHIFTCTLn, field PINCFG[17:16] (RW)
 *
 * Values:
 * - 00 - Shifter pin output disabled
 * - 01 - Shifter pin open drain or bidirectional output enable
 * - 10 - Shifter pin bidirectional output data
 * - 11 - Shifter pin output
 */
/*@{*/
#define BP_FLEXIO_SHIFTCTLn_PINCFG (16U)   /*!< Bit position for FLEXIO_SHIFTCTLn_PINCFG. */
#define BM_FLEXIO_SHIFTCTLn_PINCFG (0x00030000U) /*!< Bit mask for FLEXIO_SHIFTCTLn_PINCFG. */
#define BS_FLEXIO_SHIFTCTLn_PINCFG (2U)    /*!< Bit field size in bits for FLEXIO_SHIFTCTLn_PINCFG. */

/*! @brief Read current value of the FLEXIO_SHIFTCTLn_PINCFG field. */
#define BR_FLEXIO_SHIFTCTLn_PINCFG(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), BP_FLEXIO_SHIFTCTLn_PINCFG, BS_FLEXIO_SHIFTCTLn_PINCFG))

/*! @brief Format value for bitfield FLEXIO_SHIFTCTLn_PINCFG. */
#define BF_FLEXIO_SHIFTCTLn_PINCFG(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_PINCFG) & BM_FLEXIO_SHIFTCTLn_PINCFG)

/*! @brief Set the PINCFG field to a new value. */
#define BW_FLEXIO_SHIFTCTLn_PINCFG(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_PINCFG), BP_FLEXIO_SHIFTCTLn_PINCFG, 2))
/*@}*/

/*!
 * @name Register FLEXIO_SHIFTCTLn, field TIMPOL[23] (RW)
 *
 * Values:
 * - 0 - Shift on posedge of Shift clock
 * - 1 - Shift on negedge of Shift clock
 */
/*@{*/
#define BP_FLEXIO_SHIFTCTLn_TIMPOL (23U)   /*!< Bit position for FLEXIO_SHIFTCTLn_TIMPOL. */
#define BM_FLEXIO_SHIFTCTLn_TIMPOL (0x00800000U) /*!< Bit mask for FLEXIO_SHIFTCTLn_TIMPOL. */
#define BS_FLEXIO_SHIFTCTLn_TIMPOL (1U)    /*!< Bit field size in bits for FLEXIO_SHIFTCTLn_TIMPOL. */

/*! @brief Read current value of the FLEXIO_SHIFTCTLn_TIMPOL field. */
#define BR_FLEXIO_SHIFTCTLn_TIMPOL(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), BP_FLEXIO_SHIFTCTLn_TIMPOL, BS_FLEXIO_SHIFTCTLn_TIMPOL))

/*! @brief Format value for bitfield FLEXIO_SHIFTCTLn_TIMPOL. */
#define BF_FLEXIO_SHIFTCTLn_TIMPOL(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_TIMPOL) & BM_FLEXIO_SHIFTCTLn_TIMPOL)

/*! @brief Set the TIMPOL field to a new value. */
#define BW_FLEXIO_SHIFTCTLn_TIMPOL(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_TIMPOL), BP_FLEXIO_SHIFTCTLn_TIMPOL, 1))
/*@}*/

/*!
 * @name Register FLEXIO_SHIFTCTLn, field TIMSEL[25:24] (RW)
 *
 * Selects which Timer is used for controlling the logic/shift register and
 * generating the Shift clock.
 */
/*@{*/
#define BP_FLEXIO_SHIFTCTLn_TIMSEL (24U)   /*!< Bit position for FLEXIO_SHIFTCTLn_TIMSEL. */
#define BM_FLEXIO_SHIFTCTLn_TIMSEL (0x03000000U) /*!< Bit mask for FLEXIO_SHIFTCTLn_TIMSEL. */
#define BS_FLEXIO_SHIFTCTLn_TIMSEL (2U)    /*!< Bit field size in bits for FLEXIO_SHIFTCTLn_TIMSEL. */

/*! @brief Read current value of the FLEXIO_SHIFTCTLn_TIMSEL field. */
#define BR_FLEXIO_SHIFTCTLn_TIMSEL(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), BP_FLEXIO_SHIFTCTLn_TIMSEL, BS_FLEXIO_SHIFTCTLn_TIMSEL))

/*! @brief Format value for bitfield FLEXIO_SHIFTCTLn_TIMSEL. */
#define BF_FLEXIO_SHIFTCTLn_TIMSEL(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_TIMSEL) & BM_FLEXIO_SHIFTCTLn_TIMSEL)

/*! @brief Set the TIMSEL field to a new value. */
#define BW_FLEXIO_SHIFTCTLn_TIMSEL(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCTLn_TIMSEL), BP_FLEXIO_SHIFTCTLn_TIMSEL, 2))
/*@}*/

