nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_flexio.h
/*******************************************************************************
 * HW_FLEXIO_SHIFTCFGn - Shifter Configuration N Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTCFGn - Shifter Configuration N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftcfgn
{
    uint32_t U;
    struct _hw_flexio_shiftcfgn_bitfields
    {
        uint32_t SSTART : 2;           /*!< [1:0] Shifter Start bit */
        uint32_t RESERVED0 : 2;        /*!< [3:2]  */
        uint32_t SSTOP : 2;            /*!< [5:4] Shifter Stop bit */
        uint32_t RESERVED1 : 2;        /*!< [7:6]  */
        uint32_t INSRC : 1;            /*!< [8] Input Source */
        uint32_t RESERVED2 : 23;       /*!< [31:9]  */
    } B;
} hw_flexio_shiftcfgn_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTCFGn register
 */
/*@{*/
#define HW_FLEXIO_SHIFTCFGn_COUNT (4U)

#define HW_FLEXIO_SHIFTCFGn_ADDR(x, n) ((x) + 0x100U + (0x4U * (n)))

#define HW_FLEXIO_SHIFTCFGn(x, n) (*(__IO hw_flexio_shiftcfgn_t *) HW_FLEXIO_SHIFTCFGn_ADDR(x, n))
#define HW_FLEXIO_SHIFTCFGn_RD(x, n) (HW_FLEXIO_SHIFTCFGn(x, n).U)
#define HW_FLEXIO_SHIFTCFGn_WR(x, n, v) (HW_FLEXIO_SHIFTCFGn(x, n).U = (v))
#define HW_FLEXIO_SHIFTCFGn_SET(x, n, v) (BME_OR32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTCFGn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTCFGn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTCFGn bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTCFGn, field SSTART[1:0] (RW)
 *
 * For SMOD=Transmit, this field allows automatic start bit insertion if the
 * selected timer has also enabled a start bit. For SMOD=Receive or Match Store,
 * this field allows automatic start bit checking if the selected timer has also
 * enabled a start bit.
 *
 * Values:
 * - 00 - Start bit disabled for transmitter/receiver/match store, transmitter
 *     loads data on enable
 * - 01 - Start bit disabled for transmitter/receiver/match store, transmitter
 *     loads data on first shift
 * - 10 - Transmitter outputs start bit value 0 before loading data on first
 *     shift, receiver/match store sets error flag if start bit is not 0
 * - 11 - Transmitter outputs start bit value 1 before loading data on first
 *     shift, receiver/match store sets error flag if start bit is not 1
 */
/*@{*/
#define BP_FLEXIO_SHIFTCFGn_SSTART (0U)    /*!< Bit position for FLEXIO_SHIFTCFGn_SSTART. */
#define BM_FLEXIO_SHIFTCFGn_SSTART (0x00000003U) /*!< Bit mask for FLEXIO_SHIFTCFGn_SSTART. */
#define BS_FLEXIO_SHIFTCFGn_SSTART (2U)    /*!< Bit field size in bits for FLEXIO_SHIFTCFGn_SSTART. */

/*! @brief Read current value of the FLEXIO_SHIFTCFGn_SSTART field. */
#define BR_FLEXIO_SHIFTCFGn_SSTART(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), BP_FLEXIO_SHIFTCFGn_SSTART, BS_FLEXIO_SHIFTCFGn_SSTART))

/*! @brief Format value for bitfield FLEXIO_SHIFTCFGn_SSTART. */
#define BF_FLEXIO_SHIFTCFGn_SSTART(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCFGn_SSTART) & BM_FLEXIO_SHIFTCFGn_SSTART)

/*! @brief Set the SSTART field to a new value. */
#define BW_FLEXIO_SHIFTCFGn_SSTART(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCFGn_SSTART), BP_FLEXIO_SHIFTCFGn_SSTART, 2))
/*@}*/

/*!
 * @name Register FLEXIO_SHIFTCFGn, field SSTOP[5:4] (RW)
 *
 * For SMOD=Transmit, this field allows automatic stop bit insertion if the
 * selected timer has also enabled a stop bit. For SMOD=Receive or Match Store, this
 * field allows automatic stop bit checking if the selected timer has also
 * enabled a stop bit.
 *
 * Values:
 * - 00 - Stop bit disabled for transmitter/receiver/match store
 * - 01 - Reserved for transmitter/receiver/match store
 * - 10 - Transmitter outputs stop bit value 0 on store, receiver/match store
 *     sets error flag if stop bit is not 0
 * - 11 - Transmitter outputs stop bit value 1 on store, receiver/match store
 *     sets error flag if stop bit is not 1
 */
/*@{*/
#define BP_FLEXIO_SHIFTCFGn_SSTOP (4U)     /*!< Bit position for FLEXIO_SHIFTCFGn_SSTOP. */
#define BM_FLEXIO_SHIFTCFGn_SSTOP (0x00000030U) /*!< Bit mask for FLEXIO_SHIFTCFGn_SSTOP. */
#define BS_FLEXIO_SHIFTCFGn_SSTOP (2U)     /*!< Bit field size in bits for FLEXIO_SHIFTCFGn_SSTOP. */

/*! @brief Read current value of the FLEXIO_SHIFTCFGn_SSTOP field. */
#define BR_FLEXIO_SHIFTCFGn_SSTOP(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), BP_FLEXIO_SHIFTCFGn_SSTOP, BS_FLEXIO_SHIFTCFGn_SSTOP))

/*! @brief Format value for bitfield FLEXIO_SHIFTCFGn_SSTOP. */
#define BF_FLEXIO_SHIFTCFGn_SSTOP(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCFGn_SSTOP) & BM_FLEXIO_SHIFTCFGn_SSTOP)

/*! @brief Set the SSTOP field to a new value. */
#define BW_FLEXIO_SHIFTCFGn_SSTOP(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCFGn_SSTOP), BP_FLEXIO_SHIFTCFGn_SSTOP, 2))
/*@}*/

/*!
 * @name Register FLEXIO_SHIFTCFGn, field INSRC[8] (RW)
 *
 * Selects the input source for the shifter.
 *
 * Values:
 * - 0 - Pin
 * - 1 - Shifter N+1 Output
 */
/*@{*/
#define BP_FLEXIO_SHIFTCFGn_INSRC (8U)     /*!< Bit position for FLEXIO_SHIFTCFGn_INSRC. */
#define BM_FLEXIO_SHIFTCFGn_INSRC (0x00000100U) /*!< Bit mask for FLEXIO_SHIFTCFGn_INSRC. */
#define BS_FLEXIO_SHIFTCFGn_INSRC (1U)     /*!< Bit field size in bits for FLEXIO_SHIFTCFGn_INSRC. */

/*! @brief Read current value of the FLEXIO_SHIFTCFGn_INSRC field. */
#define BR_FLEXIO_SHIFTCFGn_INSRC(x, n) (BME_UBFX32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), BP_FLEXIO_SHIFTCFGn_INSRC, BS_FLEXIO_SHIFTCFGn_INSRC))

/*! @brief Format value for bitfield FLEXIO_SHIFTCFGn_INSRC. */
#define BF_FLEXIO_SHIFTCFGn_INSRC(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTCFGn_INSRC) & BM_FLEXIO_SHIFTCFGn_INSRC)

/*! @brief Set the INSRC field to a new value. */
#define BW_FLEXIO_SHIFTCFGn_INSRC(x, n, v) (BME_BFI32(HW_FLEXIO_SHIFTCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_SHIFTCFGn_INSRC), BP_FLEXIO_SHIFTCFGn_INSRC, 1))
/*@}*/

