nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_flexio.h
/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMDEC field. */
#define BR_FLEXIO_TIMCFGn_TIMDEC(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMDEC, BS_FLEXIO_TIMCFGn_TIMDEC))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMDEC. */
#define BF_FLEXIO_TIMCFGn_TIMDEC(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMDEC) & BM_FLEXIO_TIMCFGn_TIMDEC)

/*! @brief Set the TIMDEC field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMDEC(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMDEC), BP_FLEXIO_TIMCFGn_TIMDEC, 2))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMOUT[25:24] (RW)
 *
 * Configures the initial state of the Timer Output and whether it is affected
 * by the Timer reset.
 *
 * Values:
 * - 00 - Timer output is logic one when enabled and is not affected by timer
 *     reset
 * - 01 - Timer output is logic zero when enabled and is not affected by timer
 *     reset
 * - 10 - Timer output is logic one when enabled and on timer reset
 * - 11 - Timer output is logic zero when enabled and on timer reset
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMOUT (24U)     /*!< Bit position for FLEXIO_TIMCFGn_TIMOUT. */
#define BM_FLEXIO_TIMCFGn_TIMOUT (0x03000000U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMOUT. */
#define BS_FLEXIO_TIMCFGn_TIMOUT (2U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMOUT. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMOUT field. */
#define BR_FLEXIO_TIMCFGn_TIMOUT(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMOUT, BS_FLEXIO_TIMCFGn_TIMOUT))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMOUT. */
#define BF_FLEXIO_TIMCFGn_TIMOUT(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMOUT) & BM_FLEXIO_TIMCFGn_TIMOUT)

/*! @brief Set the TIMOUT field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMOUT(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMOUT), BP_FLEXIO_TIMCFGn_TIMOUT, 2))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_TIMCMPn - Timer Compare N Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_TIMCMPn - Timer Compare N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_timcmpn
{
    uint32_t U;
    struct _hw_flexio_timcmpn_bitfields
    {
        uint32_t CMP : 16;             /*!< [15:0] Timer Compare Value */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_flexio_timcmpn_t;

/*!
 * @name Constants and macros for entire FLEXIO_TIMCMPn register
 */
/*@{*/
#define HW_FLEXIO_TIMCMPn_COUNT (4U)

#define HW_FLEXIO_TIMCMPn_ADDR(x, n) ((x) + 0x500U + (0x4U * (n)))

#define HW_FLEXIO_TIMCMPn(x, n)  (*(__IO hw_flexio_timcmpn_t *) HW_FLEXIO_TIMCMPn_ADDR(x, n))
#define HW_FLEXIO_TIMCMPn_RD(x, n) (HW_FLEXIO_TIMCMPn(x, n).U)
#define HW_FLEXIO_TIMCMPn_WR(x, n, v) (HW_FLEXIO_TIMCMPn(x, n).U = (v))
#define HW_FLEXIO_TIMCMPn_SET(x, n, v) (BME_OR32(HW_FLEXIO_TIMCMPn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_TIMCMPn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_TIMCMPn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_TIMCMPn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_TIMCMPn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_TIMCMPn bitfields
 */

/*!
 * @name Register FLEXIO_TIMCMPn, field CMP[15:0] (RW)
 *
 * The timer compare value is loaded into the timer counter when the timer is
 * first enabled, when the timer is reset and when the timer decrements down to
 * zero. In dual 8-bit counters baud/bit mode, the lower 8-bits configures the baud
 * rate divider equal to (CMP[7:0] + 1) * 2. The upper 8-bits configure the
 * number of bits in each word equal to (CMP[15:8] + 1) / 2. In dual 8-bit counters
 * PWM mode, the lower 8-bits configure the high period of the output to (CMP[7:0]
 * + 1) * 2. The upper 8-bits configure the low period of the output to
 * (CMP[15:8] + 1) * 2. In 16-bit counter mode, the compare value can be used to generate
 * the baud rate divider (if shift clock source is timer output) to equal
 * (CMP[15:0] + 1) * 2. When the shift clock source is a pin or trigger input, the
 * compare register is used to set the number of bits in each word equal to (CMP[15:0]
 * + 1) / 2.
 */
/*@{*/
#define BP_FLEXIO_TIMCMPn_CMP (0U)         /*!< Bit position for FLEXIO_TIMCMPn_CMP. */
#define BM_FLEXIO_TIMCMPn_CMP (0x0000FFFFU) /*!< Bit mask for FLEXIO_TIMCMPn_CMP. */
#define BS_FLEXIO_TIMCMPn_CMP (16U)        /*!< Bit field size in bits for FLEXIO_TIMCMPn_CMP. */

/*! @brief Read current value of the FLEXIO_TIMCMPn_CMP field. */
#define BR_FLEXIO_TIMCMPn_CMP(x, n) (BME_UBFX32(HW_FLEXIO_TIMCMPn_ADDR(x, n), BP_FLEXIO_TIMCMPn_CMP, BS_FLEXIO_TIMCMPn_CMP))

/*! @brief Format value for bitfield FLEXIO_TIMCMPn_CMP. */
#define BF_FLEXIO_TIMCMPn_CMP(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCMPn_CMP) & BM_FLEXIO_TIMCMPn_CMP)

/*! @brief Set the CMP field to a new value. */
#define BW_FLEXIO_TIMCMPn_CMP(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCMPn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCMPn_CMP), BP_FLEXIO_TIMCMPn_CMP, 16))
/*@}*/

/*******************************************************************************
 * hw_flexio_t - module struct
 ******************************************************************************/
/*!
 * @brief All FLEXIO module registers.
 */
#pragma pack(1)
typedef struct _hw_flexio
{
    __I hw_flexio_verid_t VERID;           /*!< [0x0] Version ID Register */
    __I hw_flexio_param_t PARAM;           /*!< [0x4] Parameter Register */
    __IO hw_flexio_ctrl_t CTRL;            /*!< [0x8] FlexIO Control Register */
    uint8_t _reserved0[4];
    __IO hw_flexio_shiftstat_t SHIFTSTAT;  /*!< [0x10] Shifter Status Register */
    __IO hw_flexio_shifterr_t SHIFTERR;    /*!< [0x14] Shifter Error Register */
    __IO hw_flexio_timstat_t TIMSTAT;      /*!< [0x18] Timer Status Register */
    uint8_t _reserved1[4];
    __IO hw_flexio_shiftsien_t SHIFTSIEN;  /*!< [0x20] Shifter Status Interrupt Enable */
    __IO hw_flexio_shifteien_t SHIFTEIEN;  /*!< [0x24] Shifter Error Interrupt Enable */
    __IO hw_flexio_timien_t TIMIEN;        /*!< [0x28] Timer Interrupt Enable Register */
    uint8_t _reserved2[4];
    __IO hw_flexio_shiftsden_t SHIFTSDEN;  /*!< [0x30] Shifter Status DMA Enable */
    uint8_t _reserved3[76];
    __IO hw_flexio_shiftctln_t SHIFTCTLn[4]; /*!< [0x80] Shifter Control N Register */
    uint8_t _reserved4[112];
    __IO hw_flexio_shiftcfgn_t SHIFTCFGn[4]; /*!< [0x100] Shifter Configuration N Register */
    uint8_t _reserved5[240];
    __IO hw_flexio_shiftbufn_t SHIFTBUFn[4]; /*!< [0x200] Shifter Buffer N Register */
    uint8_t _reserved6[112];
    __IO hw_flexio_shiftbufbbsn_t SHIFTBUFBBSn[4]; /*!< [0x280] Shifter Buffer N Bit Byte Swapped Register */
    uint8_t _reserved7[112];
    __IO hw_flexio_shiftbufbysn_t SHIFTBUFBYSn[4]; /*!< [0x300] Shifter Buffer N Byte Swapped Register */
    uint8_t _reserved8[112];
    __IO hw_flexio_shiftbufbisn_t SHIFTBUFBISn[4]; /*!< [0x380] Shifter Buffer N Bit Swapped Register */
    uint8_t _reserved9[112];
    __IO hw_flexio_timctln_t TIMCTLn[4];   /*!< [0x400] Timer Control N Register */
    uint8_t _reserved10[112];
    __IO hw_flexio_timcfgn_t TIMCFGn[4];   /*!< [0x480] Timer Configuration N Register */
    uint8_t _reserved11[112];
    __IO hw_flexio_timcmpn_t TIMCMPn[4];   /*!< [0x500] Timer Compare N Register */
} hw_flexio_t;
#pragma pack()

/*! @brief Macro to access all FLEXIO registers. */
/*! @param x FLEXIO module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_FLEXIO(FLEXIO_BASE)</code>. */
#define HW_FLEXIO(x)   (*(hw_flexio_t *)(x))

#endif /* __HW_FLEXIO_REGISTERS_H__ */
/* EOF */
